benchmark/result/httpaf.log
Running 1m test @ http://localhost:3000/
  8 threads and 10000 connections
  Thread calibration: mean lat.: 4.688ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 4.576ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 4.412ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 3.616ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.312ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 3.558ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 3.651ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 4.426ms, rate sampling interval: 17ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.69ms    1.15ms   8.65ms   72.78%
    Req/Sec   100.64    409.14     2.41k    94.24%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.59ms
 75.000%    3.19ms
 90.000%    4.17ms
 99.000%    6.28ms
 99.900%    8.00ms
 99.990%    8.47ms
 99.999%    8.65ms
100.000%    8.65ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.205     0.000000            1         1.00
       1.384     0.100000         3186         1.11
       1.751     0.200000         6373         1.25
       2.065     0.300000         9553         1.43
       2.311     0.400000        12758         1.67
       2.589     0.500000        15938         2.00
       2.693     0.550000        17530         2.22
       2.801     0.600000        19113         2.50
       2.925     0.650000        20713         2.86
       3.035     0.700000        22305         3.33
       3.193     0.750000        23875         4.00
       3.303     0.775000        24671         4.44
       3.403     0.800000        25477         5.00
       3.501     0.825000        26265         5.71
       3.665     0.850000        27062         6.67
       3.913     0.875000        27859         8.00
       4.065     0.887500        28255         8.89
       4.167     0.900000        28657        10.00
       4.291     0.912500        29050        11.43
       4.439     0.925000        29448        13.33
       4.651     0.937500        29847        16.00
       4.775     0.943750        30046        17.78
       4.927     0.950000        30242        20.00
       5.071     0.956250        30442        22.86
       5.215     0.962500        30642        26.67
       5.383     0.968750        30840        32.00
       5.455     0.971875        30943        35.56
       5.555     0.975000        31038        40.00
       5.679     0.978125        31137        45.71
       5.767     0.981250        31238        53.33
       5.931     0.984375        31336        64.00
       6.003     0.985938        31387        71.11
       6.103     0.987500        31438        80.00
       6.207     0.989062        31485        91.43
       6.343     0.990625        31535       106.67
       6.487     0.992188        31585       128.00
       6.611     0.992969        31610       142.22
       6.891     0.993750        31635       160.00
       7.147     0.994531        31659       182.86
       7.335     0.995313        31684       213.33
       7.483     0.996094        31709       256.00
       7.543     0.996484        31722       284.44
       7.599     0.996875        31734       320.00
       7.659     0.997266        31746       365.71
       7.735     0.997656        31759       426.67
       7.799     0.998047        31771       512.00
       7.847     0.998242        31778       568.89
       7.899     0.998437        31784       640.00
       7.931     0.998633        31791       731.43
       7.955     0.998828        31796       853.33
       8.015     0.999023        31802      1024.00
       8.071     0.999121        31806      1137.78
       8.087     0.999219        31809      1280.00
       8.115     0.999316        31812      1462.86
       8.155     0.999414        31815      1706.67
       8.187     0.999512        31818      2048.00
       8.247     0.999561        31821      2275.56
       8.247     0.999609        31821      2560.00
       8.279     0.999658        31823      2925.71
       8.295     0.999707        31825      3413.33
       8.383     0.999756        31826      4096.00
       8.415     0.999780        31827      4551.11
       8.415     0.999805        31827      5120.00
       8.447     0.999829        31828      5851.43
       8.455     0.999854        31829      6826.67
       8.471     0.999878        31831      8192.00
       8.471     0.999890        31831      9102.22
       8.471     0.999902        31831     10240.00
       8.471     0.999915        31831     11702.86
       8.471     0.999927        31831     13653.33
       8.575     0.999939        31832     16384.00
       8.575     0.999945        31832     18204.44
       8.575     0.999951        31832     20480.00
       8.575     0.999957        31832     23405.71
       8.575     0.999963        31832     27306.67
       8.655     0.999969        31833     32768.00
       8.655     1.000000        31833          inf
#[Mean    =        2.687, StdDeviation   =        1.147]
#[Max     =        8.648, Total count    =        31833]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  43022 requests in 1.00m, 85.91MB read
  Socket errors: connect 9757, read 69, write 0, timeout 253682
Requests/sec:    716.96
Transfer/sec:      1.43MB