benchmark/result/httpaf.log
Running 1m test @ http://localhost:3000/
  8 threads and 10000 connections
  Thread calibration: mean lat.: 824.461ms, rate sampling interval: 4259ms
  Thread calibration: mean lat.: 834.810ms, rate sampling interval: 4268ms
  Thread calibration: mean lat.: 823.489ms, rate sampling interval: 4259ms
  Thread calibration: mean lat.: 826.216ms, rate sampling interval: 4259ms
  Thread calibration: mean lat.: 817.801ms, rate sampling interval: 4235ms
  Thread calibration: mean lat.: 832.006ms, rate sampling interval: 4259ms
  Thread calibration: mean lat.: 815.519ms, rate sampling interval: 4255ms
  Thread calibration: mean lat.: 831.823ms, rate sampling interval: 4259ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.43s     7.46s   36.83s    55.91%
    Req/Sec    16.41     13.03    52.00     64.10%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   31.77s 
 75.000%   35.00s 
 90.000%   35.98s 
 99.000%   36.83s 
 99.900%   36.83s 
 99.990%   36.86s 
 99.999%   36.86s 
100.000%   36.86s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   15613.951     0.000000           62         1.00
   17793.023     0.100000          579         1.11
   18956.287     0.200000         1188         1.25
   19906.559     0.300000         1743         1.43
   27361.279     0.400000         2295         1.67
   31768.575     0.500000         2880         2.00
   33439.743     0.550000         3193         2.22
   33816.575     0.600000         3501         2.50
   34209.791     0.650000         3750         2.86
   34603.007     0.700000         4045         3.33
   34996.223     0.750000         4302         4.00
   35160.063     0.775000         4502         4.44
   35356.671     0.800000         4590         5.00
   35454.975     0.825000         4735         5.71
   35586.047     0.850000         4877         6.67
   35815.423     0.875000         5037         8.00
   35979.263     0.887500         5190         8.89
   35979.263     0.900000         5190        10.00
   36208.639     0.912500         5342        11.43
   36208.639     0.925000         5342        13.33
   36339.711     0.937500         5381        16.00
   36372.479     0.943750         5481        17.78
   36372.479     0.950000         5481        20.00
   36405.247     0.956250         5489        22.86
   36634.623     0.962500         5538        26.67
   36667.391     0.968750         5633        32.00
   36667.391     0.971875         5633        35.56
   36667.391     0.975000         5633        40.00
   36667.391     0.978125         5633        45.71
   36667.391     0.981250         5633        53.33
   36700.159     0.984375         5653        64.00
   36765.695     0.985938         5656        71.11
   36831.231     0.987500         5732        80.00
   36831.231     0.989062         5732        91.43
   36831.231     0.990625         5732       106.67
   36831.231     0.992188         5732       128.00
   36831.231     0.992969         5732       142.22
   36831.231     0.993750         5732       160.00
   36831.231     0.994531         5732       182.86
   36831.231     0.995313         5732       213.33
   36831.231     0.996094         5732       256.00
   36831.231     0.996484         5732       284.44
   36831.231     0.996875         5732       320.00
   36831.231     0.997266         5732       365.71
   36831.231     0.997656         5732       426.67
   36831.231     0.998047         5732       512.00
   36831.231     0.998242         5732       568.89
   36831.231     0.998437         5732       640.00
   36831.231     0.998633         5732       731.43
   36831.231     0.998828         5732       853.33
   36831.231     0.999023         5732      1024.00
   36831.231     0.999121         5732      1137.78
   36831.231     0.999219         5732      1280.00
   36863.999     0.999316         5736      1462.86
   36863.999     1.000000         5736          inf
#[Mean    =    28426.239, StdDeviation   =     7456.448]
#[Max     =    36831.232, Total count    =         5736]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9248 requests in 1.02m, 18.47MB read
  Socket errors: connect 0, read 265139, write 0, timeout 704
Requests/sec:    150.77
Transfer/sec:    308.31KB