benchmark/result/opium.log
Running 1m test @ http://localhost:3000/
  8 threads and 10000 connections
  Thread calibration: mean lat.: 4.331ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 4.325ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 4.261ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 3.563ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.688ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 3.627ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.40ms    0.89ms   9.84ms   72.28%
    Req/Sec    88.68    455.47     3.56k    96.02%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.28ms
 75.000%    2.87ms
 90.000%    3.57ms
 99.000%    4.86ms
 99.900%    8.57ms
 99.990%    9.51ms
 99.999%    9.85ms
100.000%    9.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.369     0.000000            1         1.00
       1.406     0.100000         3185         1.11
       1.671     0.200000         6377         1.25
       1.891     0.300000         9553         1.43
       2.089     0.400000        12748         1.67
       2.283     0.500000        15942         2.00
       2.373     0.550000        17525         2.22
       2.491     0.600000        19124         2.50
       2.601     0.650000        20708         2.86
       2.739     0.700000        22290         3.33
       2.865     0.750000        23899         4.00
       2.943     0.775000        24682         4.44
       3.019     0.800000        25495         5.00
       3.129     0.825000        26282         5.71
       3.243     0.850000        27065         6.67
       3.405     0.875000        27861         8.00
       3.499     0.887500        28253         8.89
       3.573     0.900000        28652        10.00
       3.663     0.912500        29057        11.43
       3.797     0.925000        29448        13.33
       3.905     0.937500        29846        16.00
       3.969     0.943750        30049        17.78
       4.057     0.950000        30244        20.00
       4.143     0.956250        30443        22.86
       4.223     0.962500        30647        26.67
       4.339     0.968750        30843        32.00
       4.391     0.971875        30939        35.56
       4.435     0.975000        31044        40.00
       4.483     0.978125        31141        45.71
       4.563     0.981250        31237        53.33
       4.643     0.984375        31338        64.00
       4.691     0.985938        31390        71.11
       4.727     0.987500        31441        80.00
       4.787     0.989062        31486        91.43
       4.883     0.990625        31535       106.67
       4.955     0.992188        31586       128.00
       5.015     0.992969        31610       142.22
       5.103     0.993750        31637       160.00
       5.219     0.994531        31659       182.86
       5.531     0.995313        31684       213.33
       5.647     0.996094        31709       256.00
       5.675     0.996484        31724       284.44
       5.687     0.996875        31734       320.00
       5.731     0.997266        31746       365.71
       6.095     0.997656        31759       426.67
       6.899     0.998047        31771       512.00
       7.103     0.998242        31778       568.89
       7.291     0.998437        31784       640.00
       7.435     0.998633        31790       731.43
       7.943     0.998828        31796       853.33
       8.583     0.999023        31802      1024.00
       8.639     0.999121        31806      1137.78
       8.663     0.999219        31809      1280.00
       8.703     0.999316        31812      1462.86
       8.775     0.999414        31815      1706.67
       8.807     0.999512        31818      2048.00
       8.951     0.999561        31820      2275.56
       8.959     0.999609        31821      2560.00
       9.023     0.999658        31823      2925.71
       9.135     0.999707        31825      3413.33
       9.263     0.999756        31826      4096.00
       9.271     0.999780        31827      4551.11
       9.271     0.999805        31827      5120.00
       9.383     0.999829        31828      5851.43
       9.391     0.999854        31829      6826.67
       9.511     0.999878        31830      8192.00
       9.511     0.999890        31830      9102.22
       9.511     0.999902        31830     10240.00
       9.527     0.999915        31831     11702.86
       9.527     0.999927        31831     13653.33
       9.799     0.999939        31832     16384.00
       9.799     0.999945        31832     18204.44
       9.799     0.999951        31832     20480.00
       9.799     0.999957        31832     23405.71
       9.799     0.999963        31832     27306.67
       9.847     0.999969        31833     32768.00
       9.847     1.000000        31833          inf
#[Mean    =        2.402, StdDeviation   =        0.889]
#[Max     =        9.840, Total count    =        31833]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  43019 requests in 1.00m, 3.94MB read
  Socket errors: connect 9757, read 0, write 0, timeout 256182
  Non-2xx or 3xx responses: 43019
Requests/sec:    713.63
Transfer/sec:     66.90KB